app/views/users/show.html.erb

SELECT "plants".* FROM "plants" WHERE "plants"."user_id" = ?  [["user_id", 13]]
---
  <section class="my-plants">
      <% @user.plants.each do |plant| %>