app/views/plants/show.html.erb

<% if logged_in? %>
<% pre_like = @plant.plant_likes.find{ |like| like.user_id == current_user.id} %>
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]