app/controllers/plants_controller.rb

  def index
    @plants = Plant.all
    @users = User.all
    @user = @plants.each do |plant|
---
SELECT "plants".* FROM "plants"

  def show
    @plant = Plant.find(params[:id])
    @users = User.all
    @current_user = User.find_by(id: session[:user_id])
    @hidden_plant = Plant.find_by(id: params[:id])
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]