app/controllers/users_controller.rb

    def show
        @user = User.find_by(id: params[:id])
        @current_user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)